app/helpers/runs_helper.rb

  def current_user_been_on_run(run)
    current_user.runs.include?(run)
---
SELECT  1 AS one FROM "runs" WHERE "runs"."user_id" = ? AND "runs"."id" = ? LIMIT ?  [["user_id", 1], ["id", 6], ["LIMIT", 1]]