app/controllers/routes_controller.rb

INSERT INTO "routes" ("title", "location", "distance", "elevation", "created_at", "updated_at", "description", "condition") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @route = Route.new(route_params)
    if @route.save

SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @user = current_user
    @route = Route.find(params[:id])

SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @route = Route.find(params[:id])

SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "routes" SET "condition" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["condition", "Part of the run was blocked"], ["updated_at", "2020-01-23 01:00:26.692015"], ["id", 3]]
---
  def update
    @route = Route.find(params[:id])

    forbid_if_user_hasnt_been_on_route(@route)

    if @route.update(route_params)

SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "routes" WHERE "routes"."id" = ?  [["id", 1]]
---
  def destroy
    @route = Route.find(params[:id])
    forbid_if_user_hasnt_been_on_route(@route)

    @route.destroy