app/controllers/routes_controller.rb

DELETE FROM "routes" WHERE "routes"."id" = ?  [["id", 1]]
---
  def destroy
    @route.destroy