app/controllers/runs_controller.rb

INSERT INTO "runs" ("date", "run_time", "mood", "notes", "user_id", "route_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @run = @user.runs.build(run_params)

    @run.save ? (redirect_to user_run_path(@user, @run)) : (render :new)

UPDATE "runs" SET "notes" = ?, "conditions" = ?, "updated_at" = ? WHERE "runs"."id" = ?  [["notes", ""], ["conditions", ""], ["updated_at", "2020-10-01 23:57:39.731467"], ["id", 2]]
---
  def update
    if @run.update(run_params)

SELECT  "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
---
  def set_run
    # helper to find a given run by id param of page accessed
    @run = Run.find_by(id: params[:id])