app/controllers/runs_controller.rb

  def show
    @user = User.find(params[:user_id])
    @run = Run.find(params[:id])
---
SELECT  "runs".* FROM "runs" WHERE (2) LIMIT ?  [["LIMIT", 1]]