app/controllers/runs_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "runs".* FROM "runs" WHERE "runs"."user_id" = ? AND "runs"."id" = ? LIMIT ?  [["user_id", 1], ["id", 45], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(id: params[:user_id])
    @run = @user.runs.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "routes".* FROM "routes"
---
  def new
    @user = User.find(params[:user_id])
    @routes = Route.all

SELECT  "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "routes".* FROM "routes"
INSERT INTO "runs" ("date", "run_time", "mood", "notes", "user_id", "route_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.find(params[:run][:user_id])
    @run = @user.runs.build(run_params)
    @routes = Route.all

    if @run.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "routes".* FROM "routes"
---
  def edit
    @user = User.find(params[:user_id])
    @run = Run.find(params[:id])
    @routes = Route.all

SELECT  "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "runs" SET "mood" = ?, "notes" = ?, "updated_at" = ? WHERE "runs"."id" = ?  [["mood", "Great"], ["notes", ""], ["updated_at", "2020-01-03 01:23:28.964705"], ["id", 2]]
---
  def update
    @run = Run.find(params[:id])
    @run.update(run_params)

DELETE FROM "runs" WHERE "runs"."id" = ?  [["id", 5]]
SELECT  "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def destroy
    Run.find(params[:id]).destroy