app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "patriciaogen@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "first_name", "created_at", "updated_at", "uid") VALUES (?, ?, ?, ?, ?)  [["email", "patriciaogen@gmail.com"], ["first_name", "Patricia"], ["created_at", "2020-01-10 02:01:11.216987"], ["updated_at", "2020-01-10 02:01:11.216987"], ["uid", "114396825748217958374"]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "trish@trish.com"], ["LIMIT", 1]]
---
  def create
    if auth
      @user = User.find_by(email: auth['info']['email'])
      if @user.nil?
        @user = User.new(email: auth['info']['email'], uid: auth['uid'],
          first_name: auth['info']['first_name'])
        @user.save
      end
    else
      @user = User.find_by(email: params[:user][:email])