app/models/route.rb

  scope :most_popular_route, -> { Route.joins(:runs).group(:routes).order(
    Arel.sql('count(routes.id) desc')).first}
---
SELECT  "routes".* FROM "routes" INNER JOIN "runs" ON "runs"."route_id" = "routes"."id" GROUP BY "routes" ORDER BY count(routes.id) desc LIMIT ?  [["LIMIT", 1]]