app/models/user.rb

  def been_on_run(run)
    self.runs.include?(run)
---
SELECT  "users".* FROM "users" INNER JOIN "runs" ON "runs"."user_id" = "users"."id" INNER JOIN "routes" ON "routes"."id" = "runs"."route_id" GROUP BY "users"."id" ORDER BY sum(routes.distance) desc LIMIT ?  [["LIMIT", 1]]
SELECT  1 AS one FROM "runs" WHERE "runs"."user_id" = ? AND "runs"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]

  def been_on_route(route)
    self.routes.include?(route)
---
SELECT  "users".* FROM "users" INNER JOIN "runs" ON "runs"."user_id" = "users"."id" INNER JOIN "routes" ON "routes"."id" = "runs"."route_id" GROUP BY "user_id" ORDER BY sum(routes.distance) desc LIMIT ?  [["LIMIT", 1]]
SELECT  1 AS one FROM "routes" INNER JOIN "runs" ON "routes"."id" = "runs"."route_id" WHERE "runs"."user_id" = ? AND "routes"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]