app/models/user.rb

SELECT  "routes".* FROM "routes" INNER JOIN "runs" ON "routes"."id" = "runs"."route_id" WHERE "runs"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 11]]
---
  scope :most_miles_run, -> { joins(runs: :route).group(:id).order(
    Arel.sql('sum(routes.distance) desc')).first }